In [2]:
import pandas as pd

In [3]:
df_str = pd.DataFrame({
    'names': ['  Alice  ', 'BOB', 'charlie', 'DIANA'],
    'emails': ['alice@email.com', 'bob@COMPANY.COM', 'charlie@email.com', 'diana@company.com']
})

In [4]:
df_str

       names             emails
0    Alice      alice@email.com
1        BOB    bob@COMPANY.COM
2    charlie  charlie@email.com
3      DIANA  diana@company.com

In [5]:
# String methods (vectorized operations)
print(df_str['names'].str.lower())       # Convert to lowercase
print(df_str['names'].str.upper())       # Convert to uppercase
print(df_str['names'].str.title())       # Title case
print(df_str['names'].str.strip())       # Remove leading/trailing whitespace
print(df_str['names'].str.len())         # Length of strings

0      alice
1          bob
2      charlie
3        diana
Name: names, dtype: object
0      ALICE
1          BOB
2      CHARLIE
3        DIANA
Name: names, dtype: object
0      Alice
1          Bob
2      Charlie
3        Diana
Name: names, dtype: object
0      Alice
1        BOB
2    charlie
3      DIANA
Name: names, dtype: object
0    9
1    3
2    7
3    5
Name: names, dtype: int64

In [8]:
# String manipulation
print(df_str['names'].str.replace('e', 'E'))   # Replace characters

0      AlicE
1          BOB
2      charliE
3        DIANA
Name: names, dtype: object

In [7]:
df_str

       names             emails
0    Alice      alice@email.com
1        BOB    bob@COMPANY.COM
2    charlie  charlie@email.com
3      DIANA  diana@company.com

In [9]:
print(df_str['emails'].str.split('@'))          # Split strings

0      [alice, email.com]
1      [bob, COMPANY.COM]
2    [charlie, email.com]
3    [diana, company.com]
Name: emails, dtype: object

In [10]:
print(df_str['emails'].str.split('@', expand=True))  # Split into columns

         0            1
0    alice    email.com
1      bob  COMPANY.COM
2  charlie    email.com
3    diana  company.com

In [11]:
df_dup = pd.DataFrame({
    'A': [1, 2, 2, 3, 3, 3,4,5,6,7],
    'B': ['x', 'y', 'y', 'z', 'z', 'w',"a","b", "c", "d"],
    'C': [10, 20, 20, 30, 30, 40, 40, 50, 30, 20]
})

In [12]:
df_dup

   A  B   C
0  1  x  10
1  2  y  20
2  2  y  20
3  3  z  30
4  3  z  30
5  3  w  40
6  4  a  40
7  5  b  50
8  6  c  30
9  7  d  20

In [14]:
df_dup.duplicated().sum()

2

In [15]:
df_dup["C"].duplicated().sum()

5

In [16]:
df_dup.drop_duplicates(inplace=True)

In [17]:
df_dup

   A  B   C
0  1  x  10
1  2  y  20
3  3  z  30
5  3  w  40
6  4  a  40
7  5  b  50
8  6  c  30
9  7  d  20

In [18]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', "mohit", "suresh"],
    'Age': [25, 30, 35, 20, 28],
    'Salary': [70000, 80000, 90000, 40000, 78000]
})

In [19]:
df

      Name  Age  Salary
0    Alice   25   70000
1      Bob   30   80000
2  Charlie   35   90000
3    mohit   20   40000
4   suresh   28   78000

In [20]:
df["Name_upper"] = df["Name"].str.upper()

In [21]:
df

      Name  Age  Salary Name_upper
0    Alice   25   70000      ALICE
1      Bob   30   80000        BOB
2  Charlie   35   90000    CHARLIE
3    mohit   20   40000      MOHIT
4   suresh   28   78000     SURESH

In [22]:
df['Bonus'] = df['Salary'] * 0.1           # Calculated column

In [23]:
df

      Name  Age  Salary Name_upper   Bonus
0    Alice   25   70000      ALICE  7000.0
1      Bob   30   80000        BOB  8000.0
2  Charlie   35   90000    CHARLIE  9000.0
3    mohit   20   40000      MOHIT  4000.0
4   suresh   28   78000     SURESH  7800.0

In [24]:
df['Department'] = 'IT'

In [25]:
df

      Name  Age  Salary Name_upper   Bonus Department
0    Alice   25   70000      ALICE  7000.0         IT
1      Bob   30   80000        BOB  8000.0         IT
2  Charlie   35   90000    CHARLIE  9000.0         IT
3    mohit   20   40000      MOHIT  4000.0         IT
4   suresh   28   78000     SURESH  7800.0         IT

In [26]:
df['Full_Info'] = df['Name'] + ' (' + df['Age'].astype(str) + ')'  # String concatenation

In [27]:
df

      Name  Age  Salary Name_upper   Bonus Department     Full_Info
0    Alice   25   70000      ALICE  7000.0         IT    Alice (25)
1      Bob   30   80000        BOB  8000.0         IT      Bob (30)
2  Charlie   35   90000    CHARLIE  9000.0         IT  Charlie (35)
3    mohit   20   40000      MOHIT  4000.0         IT    mohit (20)
4   suresh   28   78000     SURESH  7800.0         IT   suresh (28)

In [30]:
# Add multiple columns using assign
df = df.assign( Tax = df['Salary'] * 0.3, Net_Salary = lambda x: x['Salary'] - x['Tax'])

In [31]:
df

,Name,Age,Salary,Name_upper,Bonus,Department,Full_Info,Tax,Net_Salary
0,Alice,25,70000,ALICE,7000.0,IT,Alice (25),21000.0,49000.0
1,Bob,30,80000,BOB,8000.0,IT,Bob (30),24000.0,56000.0
2,Charlie,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0
3,mohit,20,40000,MOHIT,4000.0,IT,mohit (20),12000.0,28000.0
4,suresh,28,78000,SURESH,7800.0,IT,suresh (28),23400.0,54600.0

In [32]:
# Insert column at specific position
df.insert(1, 'Employee_ID', ['E001', 'E002', 'E003', "E004","E005"])

In [33]:
df

,Name,Employee_ID,Age,Salary,Name_upper,Bonus,Department,Full_Info,Tax,Net_Salary
0,Alice,E001,25,70000,ALICE,7000.0,IT,Alice (25),21000.0,49000.0
1,Bob,E002,30,80000,BOB,8000.0,IT,Bob (30),24000.0,56000.0
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0
3,mohit,E004,20,40000,MOHIT,4000.0,IT,mohit (20),12000.0,28000.0
4,suresh,E005,28,78000,SURESH,7800.0,IT,suresh (28),23400.0,54600.0

In [34]:
df.insert('Employee_ID1', ['E001', 'E002', 'E003', "E004","E005"])

TypeError: DataFrame.insert() missing 1 required positional argument: 'value'

In [ ]:
df.drop("Employee_ID", axis=1, inplace=True)

In [36]:
df_renamed = df[["Name", "Age"]].rename(columns={'Name': 'Employee_Name', 'Age': 'Employee_Age'})

In [35]:
df[["Name", "Age"]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    mohit   20
4   suresh   28

In [37]:
df_renamed

  Employee_Name  Employee_Age
0         Alice            25
1           Bob            30
2       Charlie            35
3         mohit            20
4        suresh            28

In [38]:
df

,Name,Employee_ID,Age,Salary,Name_upper,Bonus,Department,Full_Info,Tax,Net_Salary
0,Alice,E001,25,70000,ALICE,7000.0,IT,Alice (25),21000.0,49000.0
1,Bob,E002,30,80000,BOB,8000.0,IT,Bob (30),24000.0,56000.0
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0
3,mohit,E004,20,40000,MOHIT,4000.0,IT,mohit (20),12000.0,28000.0
4,suresh,E005,28,78000,SURESH,7800.0,IT,suresh (28),23400.0,54600.0

In [39]:
df.columns

Index(['Name', 'Employee_ID', 'Age', 'Salary', 'Name_upper', 'Bonus',
       'Department', 'Full_Info', 'Tax', 'Net_Salary'],
      dtype='object')

In [41]:
df.loc[0:5:2, ["Name", "Age"]]

      Name  Age
0    Alice   25
2  Charlie   35
4   suresh   28

In [42]:
df.iloc[0:5:2, 0::2]

      Name  Age Name_upper Department      Tax
0    Alice   25      ALICE         IT  21000.0
2  Charlie   35    CHARLIE         IT  27000.0
4   suresh   28     SURESH         IT  23400.0

In [43]:
df.columns = ['col_' + str(i) for i in range(len(df.columns))]

In [44]:
df.columns

Index(['col_0', 'col_1', 'col_2', 'col_3', 'col_4', 'col_5', 'col_6', 'col_7',
       'col_8', 'col_9'],
      dtype='object')

In [45]:
df

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9
0,Alice,E001,25,70000,ALICE,7000.0,IT,Alice (25),21000.0,49000.0
1,Bob,E002,30,80000,BOB,8000.0,IT,Bob (30),24000.0,56000.0
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0
3,mohit,E004,20,40000,MOHIT,4000.0,IT,mohit (20),12000.0,28000.0
4,suresh,E005,28,78000,SURESH,7800.0,IT,suresh (28),23400.0,54600.0

In [46]:
df_sort = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 35, 30, 28],
    'Salary': [70000, 90000, 80000, 75000],
    'Department': ['HR', 'IT', 'Finance', 'HR']
})

In [47]:
df_sort

      Name  Age  Salary Department
0    Alice   25   70000         HR
1      Bob   35   90000         IT
2  Charlie   30   80000    Finance
3    Diana   28   75000         HR

In [48]:
print(df_sort.sort_values('Age'))                    # Ascending

      Name  Age  Salary Department
0    Alice   25   70000         HR
3    Diana   28   75000         HR
2  Charlie   30   80000    Finance
1      Bob   35   90000         IT

In [ ]:
print(df_sort.sort_values('Age', ascending=False))   # Descending

In [49]:
df_sales = pd.DataFrame({
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West'],
    'Product': ['A', 'A', 'B', 'B', 'A', 'B', 'A', 'B'],
    'Sales': [100, 150, 200, 120, 180, 160, 140, 190],
    'Profit': [20, 30, 40, 25, 35, 32, 28, 38],
    'Quarter': ['Q1', 'Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2', 'Q2']
})

In [50]:
df_sales

  Region Product  Sales  Profit Quarter
0  North       A    100      20      Q1
1  South       A    150      30      Q1
2   East       B    200      40      Q1
3   West       B    120      25      Q1
4  North       A    180      35      Q2
5  South       B    160      32      Q2
6   East       A    140      28      Q2
7   West       B    190      38      Q2

In [51]:
df_sales.groupby("Region")[["Sales", "Profit"]].sum()

        Sales  Profit
Region
East      340      68
North     280      55
South     310      62
West      310      63

In [52]:
df_sales.groupby("Region")[["Sales", "Profit"]].max()

        Sales  Profit
Region
East      200      40
North     180      35
South     160      32
West      190      38

In [53]:
df1 = pd.DataFrame({'A': [1, 2, 3,4,5], 'B': [4, 5, 6,7,8]})
df2 = pd.DataFrame({'A': [7, 8, 9,10,11], 'B': [10, 11, 12,13,14]})
df3 = pd.DataFrame({'C': [13, 14, 15,16,17], 'D': [16, 17, 18,19,20]})

In [54]:
df1

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [55]:
df2

    A   B
0   7  10
1   8  11
2   9  12
3  10  13
4  11  14

In [56]:
df3

    C   D
0  13  16
1  14  17
2  15  18
3  16  19
4  17  20

In [57]:
result_vertical = pd.concat([df1, df2, df3])
print(result_vertical)

      A     B     C     D
0   1.0   4.0   NaN   NaN
1   2.0   5.0   NaN   NaN
2   3.0   6.0   NaN   NaN
3   4.0   7.0   NaN   NaN
4   5.0   8.0   NaN   NaN
0   7.0  10.0   NaN   NaN
1   8.0  11.0   NaN   NaN
2   9.0  12.0   NaN   NaN
3  10.0  13.0   NaN   NaN
4  11.0  14.0   NaN   NaN
0   NaN   NaN  13.0  16.0
1   NaN   NaN  14.0  17.0
2   NaN   NaN  15.0  18.0
3   NaN   NaN  16.0  19.0
4   NaN   NaN  17.0  20.0

In [58]:
result_horizontal = pd.concat([df1, df3], axis=1)
print(result_horizontal)

   A  B   C   D
0  1  4  13  16
1  2  5  14  17
2  3  6  15  18
3  4  7  16  19
4  5  8  17  20

In [59]:
employees = pd.DataFrame({
    'emp_id': [1, 2, 3, 4,5],
    'name': ['Alice', 'Bob', 'Charlie', 'Diana', "abc"],
    'dept_id': [10, 20, 10, 30,40]
})

departments = pd.DataFrame({
    'dept_id': [10, 20, 30],
    'dept_name': ['Engineering', 'Marketing', 'Sales']
})

In [60]:
employees

   emp_id     name  dept_id
0       1    Alice       10
1       2      Bob       20
2       3  Charlie       10
3       4    Diana       30
4       5      abc       40

In [61]:
departments

   dept_id    dept_name
0       10  Engineering
1       20    Marketing
2       30        Sales

In [62]:
inner_merge = pd.merge(employees, departments, on ="dept_id" )
inner_merge

   emp_id     name  dept_id    dept_name
0       1    Alice       10  Engineering
1       3  Charlie       10  Engineering
2       2      Bob       20    Marketing
3       4    Diana       30        Sales

In [63]:
inner_merge = pd.merge(employees, departments, on ="dept_id", how="left" )
inner_merge

   emp_id     name  dept_id    dept_name
0       1    Alice       10  Engineering
1       2      Bob       20    Marketing
2       3  Charlie       10  Engineering
3       4    Diana       30        Sales
4       5      abc       40          NaN

In [64]:
inner_merge = pd.merge(employees, departments, on ="dept_id", how="right" )
inner_merge

   emp_id     name  dept_id    dept_name
0       1    Alice       10  Engineering
1       3  Charlie       10  Engineering
2       2      Bob       20    Marketing
3       4    Diana       30        Sales

In [65]:
df

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9
0,Alice,E001,25,70000,ALICE,7000.0,IT,Alice (25),21000.0,49000.0
1,Bob,E002,30,80000,BOB,8000.0,IT,Bob (30),24000.0,56000.0
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0
3,mohit,E004,20,40000,MOHIT,4000.0,IT,mohit (20),12000.0,28000.0
4,suresh,E005,28,78000,SURESH,7800.0,IT,suresh (28),23400.0,54600.0

In [70]:
df[df["col_2"]>=35]

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0

In [74]:
df[(df["col_2"]>=35) & (df["col_3"]>80000)]

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0

In [75]:
df[(df["col_2"]>=35) | (df["col_3"]>80000)]

,col_0,col_1,col_2,col_3,col_4,col_5,col_6,col_7,col_8,col_9
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0

In [76]:
inner_merge

   emp_id     name  dept_id    dept_name
0       1    Alice       10  Engineering
1       3  Charlie       10  Engineering
2       2      Bob       20    Marketing
3       4    Diana       30        Sales

In [78]:
df.columns =['Name', 'Employee_ID', 'Age', 'Salary', 'Name_upper', 'Bonus',
       'Department', 'Full_Info', 'Tax', 'Net_Salary']

In [79]:
df

,Name,Employee_ID,Age,Salary,Name_upper,Bonus,Department,Full_Info,Tax,Net_Salary
0,Alice,E001,25,70000,ALICE,7000.0,IT,Alice (25),21000.0,49000.0
1,Bob,E002,30,80000,BOB,8000.0,IT,Bob (30),24000.0,56000.0
2,Charlie,E003,35,90000,CHARLIE,9000.0,IT,Charlie (35),27000.0,63000.0
3,mohit,E004,20,40000,MOHIT,4000.0,IT,mohit (20),12000.0,28000.0
4,suresh,E005,28,78000,SURESH,7800.0,IT,suresh (28),23400.0,54600.0

In [81]:
df = pd.read_csv("F:\\05. sales_data_final.csv")

In [82]:
df.head()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,category,sub_category,product_name,sales,quantity,discount,profit,shipping_cost,order_priority,year
0,AG-2011-2040,1/1/2011,1/6/2011,Standard Class,Toby Braunhardt,Consumer,Constantine,Algeria,Africa,Africa,...,Office Supplies,Storage,"Tenex Lockers, Blue",408,2,0.0,106.140,35.46,Medium,2011
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Office Supplies,Supplies,"Acme Trimmer, High Speed",120,3,0.1,36.036,9.72,Medium,2011
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,Office Supplies,Storage,"Tenex Box, Single Width",66,4,0.0,29.640,8.17,High,2011
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,Office Supplies,Paper,"Enermax Note Cards, Premium",45,3,0.5,-26.055,4.82,High,2011
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Furniture,Furnishings,"Eldon Light Bulb, Duo Pack",114,5,0.1,37.770,4.70,Medium,2011

In [83]:
df.drop(0)

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,category,sub_category,product_name,sales,quantity,discount,profit,shipping_cost,order_priority,year
1,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Office Supplies,Supplies,"Acme Trimmer, High Speed",120,3,0.1,36.0360,9.72,Medium,2011
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,Office Supplies,Storage,"Tenex Box, Single Width",66,4,0.0,29.6400,8.17,High,2011
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,Office Supplies,Paper,"Enermax Note Cards, Premium",45,3,0.5,-26.0550,4.82,High,2011
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Furniture,Furnishings,"Eldon Light Bulb, Duo Pack",114,5,0.1,37.7700,4.70,Medium,2011
5,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,Office Supplies,Paper,"Eaton Computer Printout Paper, 8.5 x 11",55,2,0.1,15.3420,1.80,Medium,2011
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
51285,CA-2014-115427,12/31/2014,1/4/2015,Standard Class,Erica Bern,Corporate,California,United States,US,West,...,Office Supplies,Binders,"Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl",14,2,0.2,4.5188,0.89,Medium,2014
51286,MO-2014-2560,12/31/2014,1/5/2015,Standard Class,Liz Preis,Consumer,Souss-Massa-Dra,Morocco,Africa,Africa,...,Office Supplies,Binders,"Wilson Jones Hole Reinforcements, Clear",4,1,0.0,0.4200,0.49,Medium,2014
51287,MX-2014-110527,12/31/2014,1/2/2015,Second Class,Charlotte Melton,Consumer,Managua,Nicaragua,LATAM,Central,...,Office Supplies,Labels,"Hon Color Coded Labels, 5000 Label Set",26,3,0.0,12.3600,0.35,Medium,2014
51288,MX-2014-114783,12/31/2014,1/6/2015,Standard Class,Tamara Dahlen,Consumer,Chihuahua,Mexico,LATAM,North,...,Office Supplies,Labels,"Hon Legal Exhibit Labels, Alphabetical",7,1,0.0,0.5600,0.20,Medium,2014
51289,CA-2014-156720,12/31/2014,1/4/2015,Standard Class,Jill Matthias,Consumer,Colorado,United States,US,West,...,Office Supplies,Fasteners,Bagged Rubber Bands,3,3,0.2,-0.6048,0.17,Medium,2014

In [84]:
df.dtypes

order_id           object
order_date         object
ship_date          object
ship_mode          object
customer_name      object
segment            object
state              object
country            object
market             object
region             object
product_id         object
category           object
sub_category       object
product_name       object
sales              object
quantity            int64
discount          float64
profit            float64
shipping_cost     float64
order_priority     object
year                int64
dtype: object

In [87]:
df.groupby("country")["sales"].sum()

country
Afghanistan    712231127761317883220884,626848252793824420442...
Albania                1,619332816115836410664141825548517421919
Algeria        4089130961339433954811336299875114346313552771...
Angola         282,479825494820692554728562271074061651598644...
Argentina      1616332904018223221361941635418049221316196573...
                                     ...
Venezuela      42526369271721,0542071176258677652673631177685...
Vietnam        903917712445101382,31439412543141,799832495832...
Yemen          3917257214151284646896647261514370547857282783...
Zambia         41841212133142,1344243222063718838207136217105...
Zimbabwe       4456785128610293214191431658112162561110457154...
Name: sales, Length: 147, dtype: object

In [89]:
df["sales"].astype("int")

ValueError: invalid literal for int() with base 10: '1,648'

In [90]:
df["sales"].unique()

array(['408', '120', '66', ..., '1,763', '1,821', '1,831'], dtype=object)

In [93]:
df["sales"]= df["sales"].str.replace(",","")

In [94]:
df["sales"].unique()

array(['408', '120', '66', ..., '1763', '1821', '1831'], dtype=object)

In [96]:
df["sales"] = df["sales"].astype("int")

In [97]:
df.groupby("country")["sales"].sum()

country
Afghanistan    21674
Albania         3888
Algeria        36090
Angola         25551
Argentina      57510
               ...
Venezuela      26587
Vietnam        65802
Yemen           2464
Zambia         26029
Zimbabwe        3767
Name: sales, Length: 147, dtype: int32

In [100]:
df.groupby("region")["sales"].sum()

region
Africa             783776
Canada              66932
Caribbean          324281
Central           2822399
Central Asia       752839
EMEA               806184
East               678834
North             1248192
North Asia         848349
Oceania           1100207
South             1600960
Southeast Asia     884438
West               725514
Name: sales, dtype: int32

In [ ]:
df["region"].value_counts